genericAPI/review_version/examples/turek_hron_fsi3/fluid-openfoam/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     pimpleFoam;       

libs ("libCustomisedBCs.so" );

startFrom           startTime;

startTime           0;

stopAt              endTime;

endTime             5;

deltaT              1e-3;

writeControl   runTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat         ascii;

writePrecision      8;

writeCompression    off;

timeFormat          general;

timePrecision       8;

functions
{
    #includeFunc forces
    #includeFunc forceCoeffs
    #includeFunc probes
    #includeFunc flowRateJet1
    #includeFunc flowRateJet2
    #includeFunc preCICE_Adapter 
}
