genericAPI/review_version/examples/turek_hron_fsi3/fluid-openfoam/constant/turbulenceProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object turbulenceProperties;
}

simulationType laminar;
