genericAPI/review_version/examples/turek_hron_fsi3/fluid-openfoam/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    jet1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    jet2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    cylinder
    {
        type            noSlip;
    }    

    flap
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    top
    {
        type            noSlip;
    }

    bottom
    {
        type            noSlip;
    }

    inlet
    {
        type            timeVaryingParabolicProfile2D;
        time_ref        2;
        magU_max        1.5;
        direction       (0 1 0);
        value           uniform (0 0 0);
    }
    
    outlet
    {
        type            zeroGradient;
    }

    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}
