genericAPI/review_version/examples/turek_hron_fsi3/fluid-openfoam/system/flowRateJet1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2112
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
type            surfaceFieldValue;
libs            ("libfieldFunctionObjects.so");

writeControl    runTime;
writeInterval   0.001;

writeFields     false;
log             false;

fields (phi);
operation sum;

regionType  patch;

name    jet1;

// ************************************************************************* //