genericAPI/review_version/examples/turek_hron_fsi3/fluid-openfoam/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2112
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            forces;
libs            ("libforces.so");


// How often force and moment volume fields will be written
writeControl    writeTime; // none

// How often the forces force.dat and moment.dat data files are updated
// Note: .dat files are always updated on writeControl times
executeControl  timeStep;
executeInterval 1;

log             off;

type        forceCoeffs;

rho         rhoInf;
rhoInf      1;    // Redundant, but currently read in

patches (cylinder jet1 jet2);

magUInf     1;
lRef        0.1;	
Aref        0.02;

liftDir     (0 1 0);
dragDir     (1 0 0);
CofR        (0 0 0);
pitchAxis   (0 0 1);


// ************************************************************************* //