genericAPI/review_version/examples/turek_hron_fsi3/fluid-openfoam/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2112
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type                forces;
libs                ( "libforces.so" );
        // How often force and moment volume fields will be written
writeControl    writeTime; // none

// How often the forces force.dat and moment.dat data files are updated
// Note: .dat files are always updated on writeControl times
executeControl  runTime;
executeInterval 0.001;

log                 false;

patches             (cylinder jet1 jet2 flap);

rho                 rhoInf;
rhoInf              1000;

CofR                (0 0 0);
  
// ************************************************************************* //