genericAPI/review_version/examples/turek_hron_fsi3/fluid-openfoam/system/preCICE_Adapter
// -*- C++ -*-

type preciceAdapterFunctionObject;
libs ("libpreciceAdapterFunctionObject.so");


// ************************************************************************* //