genericAPI/review_version/examples/turek_hron_fsi3/fluid-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

preciceConfig "../../precice-config.xml";

participant Fluid;

modules (FSI FF);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh-Flap-Centers;
    patches           (flap);
    locations         faceCenters;
    
    readData
    (
    );
    
    writeData
    (
      Stress
    );
  };
  
  Interface2
  {
    mesh              Fluid-Mesh-Flap-Nodes;
    patches           (flap);
    locations         faceNodes;
    
    readData
    (
      Displacement
    );
    
    writeData
    (
    );
  };

  Interface3
  {
    mesh              Fluid-Mesh-Actuator-Centers;
    patches           (jet1 jet2);
    locations         faceCenters;
    
    readData
    (
      Velocity
    );
    
    writeData
    (
    );
  };
};

FSI
{
  rho rho [1 -3 0 0 0 0 0] 1000;
}
