genericAPI/review_version/examples/turek_hron_fsi3/fluid-openfoam/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2112
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            probes;
libs            ("libsampling.so");

writeControl    timeStep;
writeInterval   1;

fields (p);

probeLocations
(
    (0.95 0.1 0)
    (0.95 0.15 0)
    (0.95 0.2 0)
    (0.95 0.25 0)
    (0.95 0.3 0)
    (0.9 0.1 0)
    (0.9 0.15 0)
    (0.9 0.2 0)
    (0.9 0.25 0)
    (0.9 0.3 0)
    (0.85 0.1 0)
    (0.85 0.15 0)
    (0.85 0.2 0)
    (0.85 0.25 0)
    (0.85 0.3 0)
    (0.8 0.1 0)
    (0.8 0.15 0)
    (0.8 0.2 0)
    (0.8 0.25 0)
    (0.8 0.3 0)
    (0.75 0.1 0)
    (0.75 0.15 0)
    (0.75 0.2 0)
    (0.75 0.25 0)
    (0.75 0.3 0)
    (0.7 0.1 0)
    (0.7 0.15 0)
    (0.7 0.2 0)
    (0.7 0.25 0)
    (0.7 0.3 0)
    (0.698480775 0.217364818 0)
    (0.698480775 0.182635182 0)
    (0.693969262 0.234202014 0)
    (0.693969262 0.165797986 0)
    (0.68660254 0.25 0)
    (0.68660254 0.15 0)
    (0.676604444 0.264278761 0)
    (0.676604444 0.135721239 0)
    (0.675 0.2 0)
    (0.673860581 0.213023613 0)
    (0.673860581 0.186976387 0)
    (0.670476947 0.225651511 0)
    (0.670476947 0.174348489 0)
    (0.664951905 0.2375 0)
    (0.664951905 0.1625 0)
    (0.657453333 0.248209071 0)
    (0.657453333 0.151790929 0)
    (0.65 0.05 0)
    (0.65 0.1 0)
    (0.65 0.2 0)
    (0.65 0.3 0)
    (0.65 0.35 0)
    (0.63125 0.15 0)
    (0.63125 0.2 0)
    (0.63125 0.25 0)
    (0.6125 0.15 0)
    (0.6125 0.2 0)
    (0.6125 0.25 0)
    (0.6 0.05 0)
    (0.6 0.35 0)
    (0.55 0.05 0)
    (0.55 0.35 0)
    (0.5 0.05 0)
    (0.5 0.35 0)
    (0.45 0.05 0)
    (0.45 0.35 0)
    (0.4 0.05 0)
    (0.4 0.35 0)
    (0.35 0.05 0)
    (0.35 0.35 0)
    (0.3 0.1 0)
    (0.3 0.3 0)
    (0.3 0.05 0)
    (0.3 0.35 0)
    (0.275 0.1 0)
    (0.275 0.3 0)
    (0.275 0.05 0)
    (0.275 0.35 0)
    (0.264278761 0.276604444 0)
    (0.264278761 0.123395556 0)
    (0.25 0.28660254 0)
    (0.25 0.11339746 0)
    (0.25 0.1 0)
    (0.25 0.3 0)
    (0.25 0.05 0)
    (0.25 0.35 0)
    (0.248209071 0.257453333 0)
    (0.248209071 0.142546667 0)
    (0.2375 0.264951905 0)
    (0.2375 0.135048095 0)
    (0.234202014 0.293969262 0)
    (0.234202014 0.106030738 0)
    (0.225651511 0.270476947 0)
    (0.225651511 0.129523053 0)
    (0.225 0.05 0)
    (0.225 0.35 0)
    (0.217364818 0.298480775 0)
    (0.217364818 0.101519225 0)
    (0.213023613 0.273860581 0)
    (0.213023613 0.126139419 0)
    (0.2 0.275 0)
    (0.2 0.125 0)
    (0.2 0.3 0)
    (0.2 0.1 0)
    (0.2 0.1 0)
    (0.2 0.3 0)
    (0.2 0.05 0)
    (0.2 0.35 0)
    (0.186976387 0.273860581 0)
    (0.186976387 0.126139419 0)
    (0.182635182 0.298480775 0)
    (0.182635182 0.101519225 0)
    (0.175 0.05 0)
    (0.175 0.35 0)
    (0.174348489 0.270476947 0)
    (0.174348489 0.129523053 0)
    (0.165797986 0.293969262 0)
    (0.165797986 0.106030738 0)
    (0.1625 0.264951905 0)
    (0.1625 0.135048095 0)
    (0.151790929 0.257453333 0)
    (0.151790929 0.142546667 0)
    (0.15 0.28660254 0)
    (0.15 0.11339746 0)
    (0.142546667 0.248209071 0)
    (0.142546667 0.151790929 0)
    (0.135721239 0.276604444 0)
    (0.135721239 0.123395556 0)
    (0.135048095 0.2375 0)
    (0.135048095 0.1625 0)
    (0.129523053 0.225651511 0)
    (0.129523053 0.174348489 0)
    (0.126139419 0.213023613 0)
    (0.126139419 0.186976387 0)
    (0.125 0.2 0)
    (0.123395556 0.264278761 0)
    (0.123395556 0.135721239 0)
    (0.11339746 0.25 0)
    (0.11339746 0.15 0)
    (0.106030738 0.234202014 0)
    (0.106030738 0.165797986 0)
    (0.101519225 0.217364818 0)
    (0.101519225 0.182635182 0)
    (0.1 0.2 0)
);


// ************************************************************************* //

